# GetFontTableIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontTable..::..GetFontTableIterator Method
ExportFontTable Class See Also
---
Returns a FontTableIterator that iterates through the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExportFontTableIterator GetFontTableIterator()
```

Visual Basic
---
```text
Public Function GetFontTableIterator As ExportFontTableIterator
```

Visual C++
---
```text
public:
ExportFontTableIterator^ GetFontTableIterator()
```

# ### Return Value
A FontTableIterator object that can be used to iterate through key-value pairs in the collection.
# See Also
ExportFontTable Class
Autodesk.Revit.DB Namespace